"use strict";
var SplatoolsAppDispatcher = require('../dispatcher/SplatoolsAppDispatcher');
var EventEmitter = require('events').EventEmitter;
var assign = require('object-assign');
var _ = require('underscore');

// Stores
var Brand = require('../stores/Brand');
var Gear = require('../stores/Gear');

// Constant
var SplatoolsConstant = require('../constants/SplatoolsConstant');

var CHANGE_EVENT = 'change';

var ID_INDEX = 0;
var NAME_INDEX = 1;
var PART_INDEX = 2;
var MAIN_GEAR_ID_INDEX = 3;
var RARE_INDEX = 4;
var BRAND_ID_INDEX = 5;
var HAS_IMAGE_INDEX = 6;

var PART_BODY = 'body';
var PART_HEAD = 'head';
var PART_FOOT = 'foot';

// id, name, part, gear_id, rare, brand_id
var _master = [
    ["1","わかばイカT","body","10","1","1","1"],
    ["2","イカホワイト","body","4","1","1","0"],
    ["3","イカノメT ブラック","body","6","1","11","0"],
    ["4","イカノメT ライトブルー","body","18","1","11","0"],
    ["5","ロッケンベルグT ブラック","body","1","1","4","1"],
    ["6","イカブラック","body","9","1","1","0"],
    ["7","サニーオレンジT","body","8","1","3","1"],
    ["8","レイニーブルーT","body","3","1","3","0"],
    ["9","ミントT","body","2","1","8","1"],
    ["10","グレープT","body","5","1","8","0"],
    ["11","ベクトルパターン レッド","body","3","1","12","1"],
    ["12","ベクトルパターン グレー","body","12","1","12","0"],
    ["13","ヤマビコT ブルー","body","4","1","10","0"],
    ["14","ヤマビコT アイボリー","body","20","1","10","0"],
    ["15","パイレーツボーダー","body","9","1","9","0"],
    ["16","マリンボーダー","body","6","1","9","0"],
    ["17","ヤキフグ8bit ホワイト","body","21","1","7","0"],
    ["18","ヤキフグ8bit ブラック","body","2","1","7","0"],
    ["19","ラインT ホワイト","body","7","1","13","1"],
    ["20","ドカンT ブラック","body","11","1","13","0"],
    ["21","エゾッコラグラン","body","2","1","5","1"],
    ["22","カレッジラグラン","body","21","1","9","0"],
    ["23","ハラグロラグラン","body","7","1","4","0"],
    ["24","ハラシロラグラン","body","12","1","4","1"],
    ["25","ボーダーモスグリーン","body","19","1","10","0"],
    ["26","イカバッテンロング","body","20","1","1","0"],
    ["27","アイロニックロング","body","9","1","2","1"],
    ["28","レイヤード ホワイト","body","11","1","1","1"],
    ["29","マスタードガサネ","body","12","1","1","0"],
    ["30","カモガサネ","body","8","1","1","0"],
    ["31","レイヤード ブラック","body","3","1","","0"],
    ["32","アイロニックレイヤード","body","1","1","2","0"],
    ["33","かくれパイレーツ","body","1","1","11","1"],
    ["34","さくらエビポロ","body","19","1","9","0"],
    ["35","トリコロールラガー","body","10","1","12","0"],
    ["36","よもぎポロ","body","18","1","9","0"],
    ["37","バスケジャージ アウェイ","body","4","1","2","0"],
    ["38","カレッジスウェット グレー","body","7","1","9","1"],
    ["39","イカバッテンマスタード","body","13","1","1","1"],
    ["40","ウーニーズBBシャツ","body","6","1","2","0"],
    ["41","おどるイカアロハ","body","5","1","6","1"],
    ["42","シャンブレーシャツ","body","13","1","9","1"],
    ["43","ロッケンベルグT ホワイト","body","5","2","4","0"],
    ["44","ガチブラック","body","21","2","1","1"],
    ["45","ボーダーホワイト","body","10","2","9","1"],
    ["46","バニーポップ ブラック","body","12","2","5","0"],
    ["47","ボーダーネイビー","body","1","2","9","0"],
    ["48","チョコガサネ","body","4","2","12","1"],
    ["49","ベクトルラインガサネ","body","11","2","12","1"],
    ["50","オレンジボダーラガー","body","6","2","12","0"],
    ["51","マウンテンベリー","body","9","2","10","0"],
    ["52","バスケジャージ ホーム","body","11","2","2","0"],
    ["53","ホッコリー ネイビー","body","13","2","7","0"],
    ["54","イカリスウェット","body","18","2","1","1"],
    ["55","ギンガムチェック ミドリ","body","13","2","5","1"],
    ["56","シロシャツ","body","5","2","9","1"],
    ["57","ギンガムチェック アカ","body","3","2","5","1"],
    ["58","ベイビークラゲシャツ","body","2","2","9","0"],
    ["59","ブロックストライプシャツ","body","12","2","9","1"],
    ["60","アーバンベスト イエロー","body","20","2","7","0"],
    ["61","ジップアップ グリーン","body","9","2","7","0"],
    ["62","エゾッコパーカー アズキ","body","19","2","5","1"],
    ["63","スクールブレザー","body","5","2","15","0"],
    ["64","サムライジャケット","body","8","2","15","0"],
    ["65","パワードスーツ","body","10","2","15","0"],
    ["66","ヒーロージャケット レプリカ","body","7","2","14","1"],
    ["67","タコゾネスプロテクター","body","4","2","14","1"],
    ["68","ガチホワイト","body","19","3","1","1"],
    ["69","マウンテンオリーブ","body","21","3","10","1"],
    ["70","スタジャンロゴマシ","body","1","3","5","1"],
    ["71","レトロジャッジ","body","2","3","1","1"],
    ["72","ミスターベースボール","body","8","3","7","1"],
    ["73","ヴィンテージチェック","body","20","3","4","1"],
    ["74","マウンテンダウン","body","7","3","10","1"],
    ["75","アーバンベスト ナイト","body","18","3","7","1"],
    ["76","ジップアップ カモ","body","10","3","7","1"],
    ["77","フェスT","body","11","3","1","0"],
    ["78","ヘッドバンド ホワイト","head","5","1","1","1"],
    ["79","ウーニーズBBキャップ","head","13","1","8","1"],
    ["80","キャンプキャップ","head","7","1","10","1"],
    ["81","ヤコメッシュ","head","2","1","12","1"],
    ["82","ビバレッジキャップ","head","4","1","8","1"],
    ["83","エゾッコメッシュ","head","12","1","5","0"],
    ["84","バックワードキャップ","head","10","1","5","0"],
    ["85","2ラインメッシュ","head","11","1","3","1"],
    ["86","ジェットキャップ","head","11","1","7","0"],
    ["87","ショートビーニー","head","3","1","10","1"],
    ["88","ウインターボンボン","head","16","1","8","1"],
    ["89","クロブチ レトロ","head","10","1","9","0"],
    ["90","イロメガネ","head","15","1","5","0"],
    ["91","キャンプハット","head","9","1","10","1"],
    ["92","キャディ サンバイザー","head","6","1","2","1"],
    ["93","ヤキフグ サンバイザー","head","8","1","7","0"],
    ["94","バスケバンド","head","14","1","2","0"],
    ["95","スカッシュバンド","head","1","1","2","1"],
    ["96","テニスバンド","head","17","1","11","0"],
    ["97","ランニングバンド","head","4","1","5","0"],
    ["98","イカベーダーキャップ","head","8","2","8","1"],
    ["99","カモメッシュ","head","7","2","7","1"],
    ["100","5パネルキャップ","head","17","2","5","1"],
    ["101","ボンボンニット","head","12","2","9","0"],
    ["102","ボーダービーニー","head","14","2","9","0"],
    ["103","スプラッシュゴーグル","head","2","2","6","1"],
    ["104","アローバンド ブラック","head","16","2","5","1"],
    ["105","ダイバーゴーグル","head","1","2","6","1"],
    ["106","ダテコンタクト","head","8","2","11","1"],
    ["107","ロブスターブーニー","head","15","2","6","1"],
    ["108","スタジオヘッドホン","head","3","2","6","1"],
    ["109","オーロラヘッドホン","head","4","2","6","1"],
    ["110","スケボーメット","head","11","2","8","1"],
    ["111","イカパッチン","head","7","2","15","0"],
    ["112","サムライヘルメット","head","1","2","15","0"],
    ["113","パワードマスク","head","2","2","15","0"],
    ["114","ヒーローヘッズ レプリカ","head","6","2","14","1"],
    ["115","タコゾネススコープ","head","13","2","14","1"],
    ["116","チドリキャップ","head","14","3","8","1"],
    ["117","パイロットゴーグル","head","13","3","6","1"],
    ["118","アローバンド ホワイト","head","9","3","5","1"],
    ["119","サファリハット","head","3","3","7","1"],
    ["120","サイクルメット","head","5","3","8","1"],
    ["121","テンタクルズメット","head","6","3","6","1"],
    ["122","バイザーメット","head","15","3","8","1"],
    ["123","タコマスク","head","16","3","6","1"],
    ["124","フェイスゴーグル","head","17","3","6","1"],
    ["125","キャンバス ホワイト","foot","11","1","3","1"],
    ["126","グリッチョ ブルー","foot","2","1","5","1"],
    ["127","キャンバス バナナ","foot","22","1","3","1"],
    ["128","シーホース ホワイト","foot","5","1","2","0"],
    ["129","グリッチョ オレンジ","foot","7","1","5","1"],
    ["130","キャンバス クマノミ","foot","8","1","3","1"],
    ["131","キャンバスHi マッシュルーム","foot","24","1","3","1"],
    ["132","シーホースHi レッド","foot","3","1","2","1"],
    ["133","シーホースHi ゾンビ","foot","8","1","2","0"],
    ["134","シーホースHi パープル","foot","9","1","2","1"],
    ["135","キャンパスHi モロヘイヤ","foot","5","1","3","0"],
    ["136","ピンクビーンズ","foot","13","1","11","0"],
    ["137","オレンジアローズ","foot","3","1","12","0"],
    ["138","ウミウシイエロー","foot","23","1","11","1"],
    ["139","シアンビーンズ","foot","1","1","11","1"],
    ["140","ウミウシパープル","foot","6","1","11","0"],
    ["141","ブラックビーンズ","foot","10","1","11","1"],
    ["142","オイスタークロッグ","foot","6","1","3","1"],
    ["143","ブルーベリーコンフォート","foot","4","1","3","1"],
    ["144","スリッポン ブルー","foot","13","1","3","1"],
    ["145","スリッポン レッド","foot","12","1","3","0"],
    ["146","ラバーソール ホワイト","foot","7","1","4","0"],
    ["147","シーホース ブラックレザー","foot","7","2","2","1"],
    ["148","シーホース イエロー","foot","22","2","2","1"],
    ["149","キャンパスHi トマト","foot","23","2","3","1"],
    ["150","シーホースHi ゴールド","foot","6","2","2","1"],
    ["151","ホワイトアローズ","foot","9","2","12","0"],
    ["152","チョコクロッグ","foot","10","2","3","1"],
    ["153","アケビコンフォート","foot","1","2","3","1"],
    ["154","トレッキングライト","foot","5","2","10","1"],
    ["155","モトクロスブーツ","foot","10","2","4","0"],
    ["156","ヌバックブーツ イエロー","foot","13","2","4","1"],
    ["157","スリッポン チドリ","foot","2","2","3","1"],
    ["158","ラバーソール チェリー","foot","24","2","4","1"],
    ["159","ラバーソール ターコイズ","foot","8","2","4","1"],
    ["160","スクールローファー","foot","4","2","15","0"],
    ["161","サムライシューズ","foot","9","2","15","0"],
    ["162","パワードレッグス","foot","3","2","15","0"],
    ["163","ヒーローキックス レプリカ","foot","12","2","14","1"],
    ["164","タコゾネスブーツ","foot","11","2","14","1"],
    ["165","グリッチョグリーン限定版","foot","4","3","5","1"],
    ["166","ウミウシレッド","foot","11","3","11","1"],
    ["167","クレイジーアローズ","foot","24","3","12","1"],
    ["168","トレッキングプロ","foot","22","3","10","1"],
    ["169","ヌバックブーツ レッド","foot","12","3","4","0"],
    ["170","モトクロス ソリッドブルー","foot","23","3","4","0"],
    ["171","アーマーメット レプリカ","head","16","3","14","0"],
    ["172","イカンカン","head","12","1","8","0"],
    ["173","イカ娘ずきん","head","14","2","16","0"],
    ["174","サンサンサンバイザー","head","13","2","11","0"],
    ["175","スゲ","head","3","2","10","0"],
    ["176","タイショウのはちまき","head","17","2","17","0"],
    ["177","タレサン18K","head","15","3","4","0"],
    ["178","チャリキング帽","head","2","2","11","0"],
    ["179","テッカサイクルキャップ","head","13","1","2","0"],
    ["180","ナイトビジョン","head","7","3","6","0"],
    ["181","フグベルハット","head","5","1","7","0"],
    ["182","FCジャージー","body","10","3","2","0"],
    ["183","アーマージャケット レプリカ","body","8","1","14","0"],
    ["184","イカゴッチンベスト","body","9","3","3","0"],
    ["185","イカライダーBLACK","body","13","3","4","0"],
    ["186","イカライダーWHITE","body","9","2","4","0"],
    ["187","イカ娘ノースリーブ","body","1","3","16","0"],
    ["188","ガチガサネ","body","6","1","1","0"],
    ["189","カレッジスウェットネイビー","body","1","2","9","0"],
    ["190","グリーンT","body","11","2","6","0"],
    ["191","スクールジャージー","body","19","3","2","0"],
    ["192","タイシャツ","body","11","2","9","0"],
    ["193","タイショウのまえかけ","body","10","1","17","0"],
    ["194","チドリメロンT","body","7","3","8","0"],
    ["195","チャリキングジャージ","body","2","2","11","0"],
    ["196","テッカサイクルシャツ","body","18","1","2","0"],
    ["197","ニクショクT","body","2","1","7","0"],
    ["198","マルエリシャツ","body","4","2","4","0"],
    ["199","ミックスシャツ グレー","body","12","1","5","0"],
    ["200","レタード　オレンジ","body","8","2","9","0"],
    ["201","レタードグリーン","body","21","2","9","0"],
    ["202","ロゴマシマシアロハ","body","5","","5","0"],
    ["203","アーマーブーツ レプリカ","foot","3","3","14","0"],
    ["204","イカスミチップ","foot","10","1","4","0"],
    ["205","イカ娘シューズ","foot","7","2","16","0"],
    ["206","タイショウのげた","foot","6","2","17","0"],
    ["207","トレッキングカスタム","foot","9","2","10","0"],
    ["208","ベリベリホワイト","foot","4","3","9","0"],
    ["209","ベリベリレッド","foot","23","1","9","0"],
    ["210","ユデスパイカ","foot","22","3","12","0"],
    ["211","レイニーアセロラ","foot","6","1","10","0"],
    ["212","レイニーモスグリーン","foot","24","2","10","0"],
    ["213","ロッキンホワイト","foot","8","2","4","0"]
];

var _clothes = {};

function initialize(){
    _clothes = _.clone(_master);
}
initialize();

function filterByMainGear(main_gear_id) {
    if(!main_gear_id){
        return;
    }
    _clothes = _clothes.filter(function(row) {
        return row[MAIN_GEAR_ID_INDEX] === main_gear_id;
    });
}
function filterByPart(part) {
    if(!part){
        return;
    }
    _clothes = _clothes.filter(function(row) {
        return row[PART_INDEX] === part;
    });
}
function filter (query) {
    initialize();
    filterByMainGear(query.selected_main_gear);
    filterByPart(query.selected_part);
}

var Cloth = assign({}, EventEmitter.prototype, {
    /**
     * Get the entire collection of Cloth.
     * @return {object}
     */
    getAll: function() {
        return _clothes;
    },
    getAllWithBrandEffect: function(options = {}){
        var brand_dict = Brand.getHash();
        var gear_dict = Gear.getNameHash();
        var res = [];
        for ( var i in _clothes ){
            var main_gear_id = _clothes[i][MAIN_GEAR_ID_INDEX];
            var brand_id = _clothes[i][BRAND_ID_INDEX];
            var sub_effect = "";
            var sub_gear_id = null;
            if (brand_id.length > 0) {
                sub_gear_id = brand_dict[brand_id][2];
                sub_effect = gear_dict[sub_gear_id];
            }
            res.push({
                'id': _clothes[i][ID_INDEX],
                'name': _clothes[i][NAME_INDEX],
                'rare': _clothes[i][RARE_INDEX],
                'part': this.getPartLabel(_clothes[i][PART_INDEX]),
                'main_gear': gear_dict[main_gear_id],
                'main_gear_id': main_gear_id,
                'sub_gear': sub_effect,
                'sub_gear_id': sub_gear_id,
                'has_image': _clothes[i][HAS_IMAGE_INDEX]
            });
        }
        return res;
    },
    getParts: function(){
        return [PART_HEAD, PART_BODY, PART_FOOT];
    },
    getPartLabel: function(part){
        switch (part){
            case PART_HEAD:
                return 'アタマ';
            case PART_BODY:
                return 'フク';
            case PART_FOOT:
                return 'クツ';
        }
        return null;
    },
    emitChange: function() {
        this.emit(CHANGE_EVENT);
    },
    addChangeListener: function(callback) {
        this.on(CHANGE_EVENT, callback);
    },
    removeChangeListener: function(callback) {
        this.removeListener(CHANGE_EVENT, callback);
    }
});

// Register callback to handle all updates
SplatoolsAppDispatcher.register(function(action) {
    switch(action.actionType) {
        case SplatoolsConstant.ACTION_UPDATE_CLOTH_FILTER:
            filter(action.query);
            Cloth.emitChange();
            break;

        default:
            // noop
    }
});

module.exports = Cloth;
